package org.example.chapter6.method;

public class Method {



/*
    반환타입 메서드이름(타입 변수명, 타입 변수명, ....) {
        메서드 호출시 수행될 코드
    }
 */
    int add (int a, int b) {    // 선언부
        int result = a + b;     // 구현부(중괄호 내부)
        return result;
    }
/*
    매개변수 선언(parameter declaration)
    int add -> int => 반환타입(출력), add(메서드 이름)
    (int a, int b) => 매개변수선언(입력)
    매개변수는 필요한 값의 개수만큼 변수를 선언
    변수 간 구분은 쉼표(,) 를 사용
    변수의 타입이 같더라도 변수 타입 생략 불가
    선언할 수 있는 매개변수의 개수는 제한이 없지만, 입력해야할 값의 개수가 많은 경우 배열이나 참조변수 사용 가능
    값을 전혀 입력받을 필요가 없다면 괄호() 안에 아무것도 적지 않는다
 */

/*
    반환 타입(return type)
    반환값이 없는 경우 반환타입으로 'void' 작성
    작업을 수행하는데 필요한 값(입력)도, 작업수행 결과인 반환값(출력)도 없는 경우

    또한, 반환 값과 반환 타입은 일치해야 함
 */

/*

 */





}
